# Ініцілізовано функцію, напишіть в тілі функції логіку яка
# перевірить певне число на те чи воно парне або непарне.

# Функція приймає на вхід будь яке число і виводить в консоль строку типу 'Число Х є парним'.
# Наприклад:
#   oddOrEven(1) - > 'Число Х є непарним'
#   oddOrEven(20) - > 'Число Х є парним'
# Можна додавати свої тести за прикладом. Потрібно врахувати обробку можливих помилок.
x=11
if (x%2)==0:
    print('число є парним')
else:
    print('число є непераним')
#input (int())
#def oddOrEven(num):
#    print('Напишіть логіку тут...')
#
#oddOrEven(1) # 'Число Х є непарним'
#oddOrEven(20) # 'Число Х є парним'
